app/controllers/api/v1/pets_controller.rb

INSERT INTO "pets" ("type", "tracker_type", "owner_id", "in_zone", "lost_tracker", "created_at", "updated_at") VALUES ('Cat', 'small', 123, 1, 0, '2025-08-19 15:21:54.072626', '2025-08-19 15:21:54.072626') RETURNING "id"
---
  def create
    begin
      pet_class = pet_params[:type]&.constantize || Pet
      @pet = pet_class.new(pet_params)

      if @pet.save

UPDATE "pets" SET "in_zone" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["in_zone", 0], ["updated_at", "2025-08-19 15:22:35.693421"], ["id", 1]]
---
  def update
    if @pet.update(pet_params)